cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"

brew "git"
brew "gpg"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "yarn", args: ['ignore-dependencies']

cask "docker"
cask "google-chrome"
cask "google-chrome-canary"
cask "grammarly"
cask "java"
cask "jetbrains-toolbox"
cask "pomodone"
cask "raindropio"
cask "sourcetree"
cask "sublime-text"

cask "alfred"
cask "brave-browser"
cask "cheatsheet"
cask "notion"
cask "pocket-casts"
cask "spotify"
cask "telegram"
cask "telegram-desktop"
cask "tunnelbear"
cask "vlc"
cask "webtorrent"

## apps (app-store)

mas "Amphetamine", id: 937984704
mas "Animal Countdown", id: 1117246590
mas "Drafts", id: 1435957248
mas "Microsoft OneNote", id: 784801555
mas "Todoist: Organize your life", id: 585829637

## safari extentions (app-store)

mas "AdGuard for Safari", id: 1440147259
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Grammarly for Safari", id: 1462114288
mas "PiPifier", id: 1160374471
mas "Raindrop.io", id: 957810159
mas "Save to Pocket", id: 1477385213

## apps (paid)

# cask "bartender"
# cask "cleanmymac"
# cask "dash"
# cask "devonthink" ## devonthink pro server
# cask "gemini"
# cask "keep-it"
# cask "marginnote"
# cask "meta"
# cask "pdf-expert"
# cask "sketch"

# mas "1password 7 - Password Manager", id: 1333542190
# mas "Calendarique", id: 1040634920
# mas "Gestimer", id: 990588172
# mas "KeyKey — Typing Practice", id: 1035137927
# mas "Magnet", id: 441258766
# mas "MetaImage", id: 1397099749
# mas "MindNode 6", id: 1289197285  
# mas "Reeder 4", id: 1449412482
# mas "Translate Tab", id: 458887729

## safari extentions (paid app-store)

# mas "Dark Reader for Safari", id: 1438243180

## chrome pwa-apps

## https://snapdrop.net
## https://twitter.com


############################################################

# tap "devhubapp/devhub"

# brew "git-flow"
# cask "cyberduck"
# cask "devhub"
# cask "figma"
# cask "firefox-developer-edition"
# cask "github"
# cask "gitkraken"
# cask "insomnia"
# cask "postman"
# cask "prefs-editor"
# cask "skype-for-business"
# cask "slack"
# cask "sublime-merge"

# cask "android-file-transfer"
# cask "google-backup-and-sync"
# cask "iina"
# cask "logitech-options"
# cask "plex-media-server"
# cask "the-unarchiver"
# cask "vox"

## app store apps

# mas "Cleaner-App", id: 1013897218
# mas "Jira Cloud by Atlassian", id: 1475897096

## paid

# cask "canary"
# cask "cardhop"
# cask "commander-one"
# cask "dictionaries" 
# cask "elmedia-player"
# cask "fantastical"
# cask "istat-menus"
# cask "sketchup"
# cask "tripmode"

# mas "Airmail 3", id: 918858936
# mas "Microsoft Word", id: 462054704
# mas "SyncSettings", id: 1438001736

## chrome pwa apps

## https://castbox.fm

############################################################

## DiskWarrior https://www.alsoft.com/DiskWarrior/index.html
