cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

brew "git"
brew "gpg"
brew "mas"
brew "node"
brew "pinentry-mac"
brew "yarn", args: ['ignore-dependencies']

cask "google-chrome-canary"
cask "grammarly"
cask "java"
cask "jetbrains-toolbox"
cask "pomodone"
cask "raindropio"
cask "sublime-text"
cask "sourcetree"

cask "alfred"
cask "dictionaries"
cask "evernote"
cask "iina"
cask "plex-media-server"
cask "pocket-casts"
cask "telegram"
cask "webtorrent"

## app store apps

mas "1password 7 - Password Manager", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Jira Cloud by Atlassian", id: 1475897096
mas "Microsoft OneNote", id: 784801555
mas "Todoist: Organize your life", id: 585829637

## app store safari extentions

mas "AdGuard for Safari", id: 1440147259
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Grammarly for Safari", id: 1462114288
mas "PiPifier", id: 1160374471
mas "Raindrop.io", id: 957810159
mas "Save to Pocket", id: 1477385213

## paid apps

# cask "cleanmymac"
# cask "dash"
# cask "devonthink"
# cask "elmedia-player"
# cask "marginnote"
# cask "meta"
# cask "pdf-expert"

# mas "Airmail 3", id: 918858936
# mas "Gestimer", id: 990588172
# mas "Magnet", id: 441258766
# mas "MindNode 6", id: 1289197285  
# mas "Reeder 4", id: 1449412482
# mas "Translate Tab", id: 458887729

## paid safari extentions

# mas "Dark Reader for Safari", id: 1438243180

## chrome pwa apps

## https://castbox.fm
## https://twitter.com

############################################################

# tap "devhubapp/devhub"

# brew "git-flow"

# cask "cheatsheet"
# cask "cyberduck"
# cask "devhub"
# cask "docker"
# cask "figma"
# cask "firefox-developer-edition"
# cask "github"
# cask "gitkraken"
# cask "insomnia"
# cask "postman"
# cask "prefs-editor"
# cask "sketch"
# cask "skype-for-business"
# cask "slack"
# cask "sublime-merge"

# cask "android-file-transfer"
# cask "calibre"
# cask "google-backup-and-sync"
# cask "logitech-options"
# cask "onenote-importer-preview"
# cask "spotify"
# cask "the-unarchiver"
# cask "tunnelbear"
# cask "vlc"
# cask "vox"

## app store apps

# mas "Cleaner-App", id: 1013897218

## paid

# cask "cardhop"
# cask "commander-one"
# cask "fantastical"
# cask "gemini"
# cask "istat-menus"
# cask "tripmode"
# cask "canary"

# mas "Calendarique", id: 1040634920
# mas "MetaImage", id: 1397099749
# mas "Microsoft Word", id: 462054704
# mas "SyncSettings", id: 1438001736

############################################################

## DiskWarrior https://www.alsoft.com/DiskWarrior/index.html
